# pandas

In [1]:
import numpy as np
import pandas as pd

## Introduction

### Series----->pd.Series(data, index=index)

In [67]:
data=pd.Series([3,4,5,6,7])
data

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [70]:
data.values

array([3, 4, 5, 6, 7], dtype=int64)

In [71]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [72]:
data[1:3]

1    4
2    5
dtype: int64

In [74]:
data=pd.Series([0.1,0.5,0.3,1.0],
              index=['a','b','c','d'])
data

a    0.1
b    0.5
c    0.3
d    1.0
dtype: float64

In [75]:
data['d']

1.0

In [3]:
 population_dict = {'California': 38332521,
                    'Texas': 26448193,
                    'New York': 19651127,
                    'Florida': 19552860,
                    'Illinois': 12882135}
population = pd.Series(population_dict)        
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [4]:
population['California']

38332521

### DataFrame

In [6]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}

In [7]:
area=pd.Series(area_dict)

In [8]:
pd.DataFrame(area, columns=['AREA'])

              AREA
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

In [9]:
states=pd.DataFrame({'population':population,
                    'area':area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [82]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [83]:
states.columns

Index(['population', 'area'], dtype='object')

In [84]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [88]:
pd.DataFrame([{'a':1,'b':2},{'b':10,'c':20}])

     a   b     c
0  1.0   2   NaN
1  NaN  10  20.0

In [89]:
pd.DataFrame(np.random.rand(3,2))

          0         1
0  0.927725  0.013746
1  0.716463  0.047727
2  0.308453  0.663217

In [91]:
pd.DataFrame(np.random.rand(3,2),
            columns=['A','B'],
             index=['a','b','c'])

          A         B
a  0.754031  0.832235
b  0.953639  0.384537
c  0.838559  0.658781

### Index

In [104]:
ind=pd.Index([1,2,3,4,5,6])
ind

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [105]:
print('size ', ind.size)
print('shape', ind.shape)
print('ndim', ind.ndim)
print('dtype', ind.dtype)

size  6
shape (6,)
ndim 1
dtype int64

In [106]:
ind[1]

2

In [107]:
ind[::2]

Int64Index([1, 3, 5], dtype='int64')

In [109]:
ind2=pd.Index([3,5,2,55,66])

In [110]:
ind&ind2

Int64Index([2, 3, 5], dtype='int64')

In [111]:
ind|ind2

Int64Index([1, 2, 3, 4, 5, 6, 55, 66], dtype='int64')

In [112]:
ind^ind2

Int64Index([1, 4, 6, 55, 66], dtype='int64')

## Data Indexing and Selection

### Data Selection in Series

In [115]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                  index=['a', 'b', 'c', 'd']) 
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [116]:
data['b']

0.5

In [117]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [119]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [120]:
data['b']=99
data

a     0.25
b    99.00
c     0.75
d     1.00
dtype: float64

In [121]:
data['a':'c']

a     0.25
b    99.00
c     0.75
dtype: float64

In [122]:
data[0:3]

a     0.25
b    99.00
c     0.75
dtype: float64

In [123]:
data[(data>0.3)&(data<0.8)]

c    0.75
dtype: float64

In [127]:
data[['a','c']]

a    0.25
c    0.75
dtype: float64

In [128]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5]) 
data

1    a
3    b
5    c
dtype: object

In [129]:
data[1]

'a'

In [130]:
data[1:3]

3    b
5    c
dtype: object

In [131]:
data.loc[1]

'a'

In [132]:
data.iloc[1]

'b'

In [135]:
data.loc[1:3]

1    a
3    b
dtype: object

In [136]:
data.iloc[1:3]

3    b
5    c
dtype: object

### Data Selection in DataFrame

In [10]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [140]:
states.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [142]:
states['density']=states['population']/states['area']
states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [143]:
states.values

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481930e+07, 6.95662000e+05, 3.80187404e+01],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02],
       [1.95528600e+07, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.49995000e+05, 8.58837628e+01]])

In [144]:
states.values[0]

array([3.83325210e+07, 4.23967000e+05, 9.04139261e+01])

In [145]:
states.T

,California,Texas,New York,Florida,Illinois
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [157]:
states.area #select column or states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [176]:
states['Florida':'Illinois']

          population    area     density
Florida     19552860  170312  114.806121
Illinois    12882135  149995   85.883763

In [14]:
states[1:2]

       population    area
Texas    26448193  695662

In [170]:
states[states.area>200000]

            population    area    density
California    38332521  423967  90.413926
Texas         26448193  695662  38.018740

In [166]:
states.iloc[1,1] #.iloc for positional indexing

695662

In [151]:
states.loc['Texas','area'] #.loc for label based indexing

695662

In [161]:
states.loc['Texas']

population    2.644819e+07
area          6.956620e+05
density       3.801874e+01
Name: Texas, dtype: float64

In [180]:
states.loc[:,'area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [160]:
states.loc[states.density>100,['area','density']]

            area     density
New York  141297  139.076746
Florida   170312  114.806121

In [159]:
states.ix[:2,:'area']

C:\Users\xiaoy\Anaconda3\envs\buan6341_2020\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

            population    area
California    38332521  423967
Texas         26448193  695662

## Operating on Data

In [181]:
np.sum(states)

population    1.168668e+08
area          1.581233e+06
density       4.681993e+02
dtype: float64

In [184]:
np.sin(states)

            population      area   density
California    0.947749  0.346071  0.638279
Texas        -0.815607  0.285147  0.314214
New York     -0.003917  0.665984  0.749078
Florida       0.903259 -0.020935  0.990495
Illinois      0.231446  0.334661 -0.872727

In [183]:
population/area

California     90.413926
Texas          38.018740
New York      139.076746
Florida       114.806121
Illinois       85.883763
dtype: float64

In [185]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])       
B = pd.Series([1, 3, 5], index=[1, 2, 3])       
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [186]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [190]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)),                         
                 columns=list('AB'))
A

   A  B
0  2  4
1  8  3

In [204]:
B = pd.DataFrame(np.random.randint(0, 10, (3, 3)),                         
                 columns=list('ABC'))
B

   A  B  C
0  3  6  3
1  5  9  0
2  3  8  7

In [193]:
A+B

      A    B   C
0   4.0  7.0 NaN
1  13.0  4.0 NaN
2   NaN  NaN NaN

In [194]:
A.add(B,fill_value=A.stack().mean())

       A     B      C
0   4.00  7.00  11.25
1  13.00  4.00  13.25
2   6.25  4.25   6.25

In [205]:
B-B.iloc[0]

   A  B  C
0  0  0  0
1  2  3 -3
2  0  2  4

## Missing data

### None: missing data

In [23]:
a=np.array([1,None, 3,4])   #None  dtype=object
a

array([1, None, 3, 4], dtype=object)

### NaN: missing numerical data

In [21]:
b=np.array([1,np.nan,3,4])
print(b)
b.dtype

[ 1. nan  3.  4.]

dtype('float64')

In [25]:
b.sum(), b.max(),b.min()

(nan, nan, nan)

In [26]:
np.nansum(b), np.nanmax(b), np.nanmin(b)

(8.0, 4.0, 1.0)

### NaN and None in Pandas

In [27]:
pd.Series([1, np.nan,2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

### Operating on Null Values

- isnull(), notnull(), dropna(), fillna()

In [28]:
data=pd.Series([1, np.nan, 'hello', None])

In [29]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [30]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [31]:
data.dropna()

0        1
2    hello
dtype: object

In [32]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [33]:
df.dropna() #drop all rows in which any null value is present

     0    1  2
1  2.0  3.0  5

In [38]:
df.dropna(axis='column')

   2
0  2
1  5
2  6

In [35]:
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [39]:
df.dropna(axis='columns',how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [40]:
df.dropna(axis='rows', thresh=3) 
#thresh: minimun number of non_null values of the row/column to be kept

     0    1  2   3
1  2.0  3.0  5 NaN

In [41]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [42]:
df.fillna(99)

      0     1  2     3
0   1.0  99.0  2  99.0
1   2.0   3.0  5  99.0
2  99.0   4.0  6  99.0

In [43]:
df.fillna(method='ffill')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [45]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [44]:
df.fillna(method='bfill')

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

## Hierarchical Indexing

### A Multiply Indexed Series

In [47]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [49]:
index=pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [50]:
pop=pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [53]:
pop['New York']

2000    18976457
2010    19378102
dtype: int64

In [54]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

### MultiIndex as extra dimension

In [57]:
pop_df=pop.unstack() #convert multiply indexed series into dataframe
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [58]:
pop_df.stack() 
#opposite opreation: convert dataframe into multiply indexed series

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [59]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [61]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [62]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

### Methods of MultiIndex Creation

In [64]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.424970  0.751825
  2  0.128424  0.602030
b 1  0.037473  0.940766
  2  0.689280  0.800308

In [65]:
df2={('a',1):11,
     ('a',2):22,
     ('b',1):33,
     ('b',2):44}
pd.Series(df2)

a  1    11
   2    22
b  1    33
   2    44
dtype: int64

### Explicit MultiIndex Constructors

In [66]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [67]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [68]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [71]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

C:\Users\xiaoy\Anaconda3\envs\buan6341_2020\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: the 'labels' keyword is deprecated, use 'codes' instead

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

#### MultiIndex level names

In [72]:
pop.index.names = ['state', 'year']        
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### MultiIndex for columns

In [74]:
# hierarchical indices and columns 
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

In [81]:
# mock some data 
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10 
data += 37

In [82]:
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns) 
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      45.0  37.5  41.0  37.4  24.0  36.8
     2      45.0  38.1  39.0  35.9  40.0  36.2
2014 1      41.0  37.4  37.0  36.9  40.0  35.5
     2      43.0  38.9  44.0  35.0  31.0  38.3

In [83]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      41.0  37.4
     2      39.0  35.9
2014 1      37.0  36.9
     2      44.0  35.0

In [96]:
health_data['Guido','HR']

year  visit
2013  1        41.0
      2        39.0
2014  1        37.0
      2        44.0
Name: (Guido, HR), dtype: float64

In [97]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      45.0  37.5
     2      45.0  38.1

In [100]:
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        45.0
      2        45.0
2014  1        41.0
      2        43.0
Name: (Bob, HR), dtype: float64

### Indexing and Slicing a MultiIndex

In [85]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [91]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [87]:
pop['California',2000]

33871648

In [92]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [93]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [94]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

### Rearranging Multi-Indices

- Sorted
- Many of the MultiIndex slicing operations will fail if the index is not sorted.

In [104]:
pop=pop.sort_index()
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [105]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [107]:
pop.unstack()

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [108]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [109]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

- Index setting and resetting

In [111]:
pop_flat=pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [112]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

### Data aggregations on MUlti-Indices

In [114]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      45.0  37.5  41.0  37.4  24.0  36.8
     2      45.0  38.1  39.0  35.9  40.0  36.2
2014 1      41.0  37.4  37.0  36.9  40.0  35.5
     2      43.0  38.9  44.0  35.0  31.0  38.3

In [116]:
data_mean=health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     45.0  37.80  40.0  36.65  32.0  36.5
2014     42.0  38.15  40.5  35.95  35.5  36.9

In [117]:
data_mean.mean(axis=1,level='type')

type         HR       Temp
year
2013  39.000000  36.983333
2014  39.333333  37.000000

In [120]:
health_data.mean(axis=0)

subject  type
Bob      HR      43.500
         Temp    37.975
Guido    HR      40.250
         Temp    36.300
Sue      HR      33.750
         Temp    36.700
dtype: float64

In [121]:
health_data.mean(axis=1)

year  visit
2013  1        36.950000
      2        39.033333
2014  1        37.966667
      2        38.366667
dtype: float64

## Combining Datasets: Concat and Append

In [130]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

In [123]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [126]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [131]:
x=make_df('AB',[0,1])
y=make_df('AB',[2,3])

In [133]:
pd.concat([x,y])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [136]:
pd.concat([x,y],keys=['x','y'])

      A   B
x 0  A0  B0
  1  A1  B1
y 2  A2  B2
  3  A3  B3

In [139]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(pd.concat([df5, df6]))

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\xiaoy\Anaconda3\envs\buan6341_2020\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

In [140]:
print(pd.concat([df5, df6], join='inner'))

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [141]:
print(pd.concat([df5, df6], join_axes=[df5.columns]))

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

C:\Users\xiaoy\Anaconda3\envs\buan6341_2020\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

In [142]:
print(df5.append(df6))

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\xiaoy\Anaconda3\envs\buan6341_2020\lib\site-packages\pandas\core\frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

## Combining Dataset: Merge and Join

In [143]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']}) 
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})

In [145]:
df3=pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [147]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [148]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

In [155]:
pd.merge(df1, df3, left_on="employee", right_on="name")
#how='inner'/ 'outer'/ 'left'

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [151]:
pd.merge(df1, df3,left_on="employee", right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [152]:
df1.join(df3)

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

## Aggregation and Grouping

- pd.sum() .mean() .min() .max() .describe()
- count, first, last, mad, prod...
- GroupBy objects have aggregate(), filter(), transform(), and apply() methods that efficiently implement a variety of useful operations before combining the grouped data

In [159]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])

In [160]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [165]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [166]:
df.groupby('key').aggregate(['min',np.median,max])

    data
     min median max
key
A      0    1.5   3
B      1    2.5   4
C      2    3.5   5

In [169]:
df.groupby('key').transform(lambda x:x-x.mean())

   data
0  -1.5
1  -1.5
2  -1.5
3   1.5
4   1.5
5   1.5

## Pivot table

- DataFrame.pivot_table(data, values=None, index=None, columns=None,
                      aggfunc='mean', fill_value=None, margins=False,                      
                       dropna=True, margins_name='All')

## Introducing Pandas String Operations

In [170]:
data = ['peter', 'Paul', 'MARY', 'gUIDO']       
[s.capitalize() for s in data]  #doesn't work if there is null value

['Peter', 'Paul', 'Mary', 'Guido']

In [171]:
names=pd.Series(data)
names

0    peter
1     Paul
2     MARY
3    gUIDO
dtype: object

In [172]:
names.str.capitalize()

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

-str methods:
- len() lower() translate() islower()
- ljust() upper() startswith() isupper()
- rjust() find() endswith() isnumeric()
- center() rfind() isalnum() isdecimal()
- zfill() index() isalpha() split()
- strip() rindex() isdigit() rsplit()
- rstrip() capitalize() isspace() partition()
- lstrip() swapcase() istitle() rpartition()

-methods can using regular expressions
- match() Call re.match() on each element, returning a Boolean. 
- extract() Call re.match() on each element, returning matched groups as strings. 
- findall() Call re.findall() on each element. 
- replace() Replace occurrences of pattern with some other string. 
- contains() Call re.search() on each element, returning a Boolean. 
- count() Count occurrences of pattern. 
- split() Equivalent to str.split(), but accepts regexps. 
- rsplit() Equivalent to str.rsplit(), but accepts regexps.

-Miscellaneous methods
- get() Index each element 
- slice() Slice each element 
- slice_replace() Replace slice in each element with passed value 
- cat() Concatenate strings 
- repeat() Repeat values 
- normalize() Return Unicode form of string 
- pad() Add whitespace to left, right, or both sides of strings 
- wrap() Split long strings into lines with length less than a given width 
- join() Join strings in each element of the Series with passed separator 
- get_dummies() Extract dummy variables as a DataFrame

## Working with Time Series